app/Models/FBDataModel.php

INSERT INTO `fb_data` (`fb_id`, `fb_name`, `fb_email`, `fb_picture`, `fb_login_status`) VALUES ('2941528015982843', 'Nuttapong Saengprakai', 'nuttapong_egg@hotmail.com', 'https://platform-lookaside.fbsbx.com/platform/profilepic/?asid=2941528015982843&height=50&width=50&ext=1674042698&hash=AeTMyLFrONZOQMhuTZQ', 1)
---
    public function insertFBData($data)
    {
        $builder = $this->db->table('fb_data');

        return $builder->insert($data) ? $this->db->insertID() : false;

UPDATE `fb_data` SET `fb_login_status` = 1, `updated_at` = '2022-12-19 22:08:08'
WHERE `id` = '4'
---
    public function updateFBDataByID($id, $data)
    {
        $builder = $this->db->table('fb_data');

        return $builder->where('id', $id)->update($data);

SELECT *
FROM `fb_data`
WHERE `fb_id` = '2941528015982843'
---
    public function getFBData($id)
    {
        $builder = $this->db->table('fb_data');
        return $builder->where('fb_id', $id)->get()->getResult();

UPDATE `fb_data` SET `fb_login_status` = '0'
WHERE `fb_id` = '2941528015982843'
---
    public function logoutFBDataByFBID($id, $data)
    {
        $builder = $this->db->table('fb_data');

        return $builder->where('fb_id', $id)->update($data);